Catalogs/ПользователиВЕТИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ПользователиВЕТИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Comment>Учетная запись, полученная при создании и связывании пользователя с хозяйствующим субъектом</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторВерсии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийТелефон</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийEmail</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВерсионныхОбъектовВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь информационной базы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролироватьДоступныеЦели</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоГосударственныйВетеринарныйВрач</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПраваДоступаПользователейВЕТИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ПраваДоступаПользователейВЕТИС</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ХозяйствующийСубъект</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйствующиеСубъектыВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПользовательВЕТИС</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравоДоступа</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ПраваДоступаВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПользователиВЕТИС/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура КочетовЗаполнитьВсехПользователейПоТекущейСтрокеВместо(Команда)
	КочетовЗаполнитьВсехПользователейПоТекущейСтрокеВместоНаСервере(Элементы.Список.ТекущиеДанные.ссылка);
КонецПроцедуры

&НаСервере
Процедура КочетовЗаполнитьВсехПользователейПоТекущейСтрокеВместоНаСервере(ТекущийЮзверВетис)
	Юзверы=Справочники.Пользователи.Выбрать();
	Пока Юзверы.Следующий() Цикл
		
		ЮзверВетис=справочники.ПользователиВЕТИС.НайтиПоРеквизиту("Пользователь",Юзверы.Ссылка);
		Если Не ЗначениеЗаполнено(ЮзверВетис) тогда
			ЮзверВетис=Справочники.ПользователиВЕТИС.СоздатьЭлемент();
		Иначе
			ЮзверВетис=ЮзверВетис.получитьОбъект();
		КонецЕсли;
			
		//ЗаполнитьЗначенияСвойств(ЮзверВетис,ТекущийЮзверВетис);
		ЮзверВетис.НаименованиеПолное=ТекущийЮзверВетис.НаименованиеПолное;
		ЮзверВетис.Наименование=ТекущийЮзверВетис.Наименование;
		ЮзверВетис.УчетнаяЗапись=ТекущийЮзверВетис.УчетнаяЗапись;
		ЮзверВетис.Пользователь=Юзверы.ссылка;
		ЮзверВетис.записать();
		
		наб=РегистрыСведений.ПраваДоступаПользователейВЕТИС.СоздатьНаборЗаписей();
		наб.Отбор.ПравоДоступа.установить(Перечисления.ПраваДоступаВЕТИС.УполномоченноеОформлениеВозвратныхВСД);
		наб.Прочитать();
		
		ПользакСПравами=наб[0].ПользовательВЕТИС;
		
		наб=РегистрыСведений.ПраваДоступаПользователейВЕТИС.СоздатьНаборЗаписей();
		наб.Отбор.ПользовательВЕТИС.установить(ПользакСПравами);
		наб.Прочитать();
		
		Для каждого стр из наб цикл
			
			мен=РегистрыСведений.ПраваДоступаПользователейВЕТИС.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(мен,стр);
			мен.ПользовательВЕТИС=ЮзверВетис.ссылка;
			
			мен.Записать(Истина);

		КонецЦикла;
	//	стрОлд=стрОлд[0];
	//	
	//	
	//	мен=РегистрыСведений.ПраваДоступаПользователейВЕТИС.СоздатьМенеджерЗаписи();
	//	ЗаполнитьЗначенияСвойств(мен,стрОлд);
	//	мен.ПользовательВЕТИС=ЮзверВетис.ссылка;
	//	
	//	мен.Записать(Истина);
	//
	КонецЦикла;
КонецПроцедуры
